Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("ФормаЭлементаПриСозданииНаСервере", Истина);
	Настройки.Обработчики.Вставить("ОбработкаЗаполнения", Истина);
	Настройки.Обработчики.Вставить("ФормаПередЗаписьюНаСервере", Истина);
	
	Возврат Настройки;
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция ФормаЭлементаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
		МассивОписаний = Новый Массив;
		А1Э_Формы.ДобавитьОписаниеПоляОбъекта(МассивОписаний, "Наименование", , "ШаблонКоманднаяПанель");
		А1Э_Формы.ДобавитьОписаниеПоляОбъекта(МассивОписаний, "Тема", , "ШаблонКоманднаяПанель");
		А1Емэйл_А1Импорт.А1БК_ПолеВыбораНесколькихТаблицаОбъекта().ДобавитьОписание(МассивОписаний, "Ответственный", Форма);
		//Из-за корявого кода 1С это пришлось сделать на форме№
		//А1Емэйл_А1Импорт.А1БК_СохраняемоеПолеФорматированногоДокумента().ДобавитьОписание(МассивОписаний, "Шаблон");
		А1Э_УниверсальнаяФорма.ДобавитьРеквизитыИЭлементы(Форма, МассивОписаний);
		
		А1Э_ФорматированныйДокумент.УстановитьНТМЛ(Форма.Тело, А1Э_ФорматированныйДокумент.СсылкаНаИсточник(Форма).Тело.Получить());
	КонецФункции
	
	Функция ОбработкаЗаполнения(Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
		Строка = Объект.Ответственный.Добавить();
		Строка.Значение = Пользователи.ТекущийПользователь();
	КонецФункции
	
	Функция ФормаПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
		Если А1Э_Формы.ТипФормы(Форма) <> "ФормаЭлемента" Тогда Возврат Неопределено; КонецЕсли;
			
		ТекущийОбъект.Тело = Новый ХранилищеЗначения(А1Э_ФорматированныйДокумент.СтруктураНТМЛ(Форма.Тело));
	КонецФункции 
	
#КонецЕсли


