// Возвращает получателей электронного письма, соответствующих определенному набору ссылок.
// Переопределяется с помощью механизмов.
//
// Параметры:
//  МассивСсылок - Массив,Ссылка - 
// 
// Возвращаемое значение:
//   - СписокЗначений
//     * Значение - адрес электронной почты.
//     * Представление - представление адреса.
//
Функция Получатели(Знач МассивСсылок) Экспорт
	#Если Клиент Тогда
		Возврат А1Э_ОбщееСервер.РезультатФункции(ИмяМодуля() + ".Получатели", МассивСсылок);
	#Иначе
		МассивСсылок = А1Э_Массивы.Массив(МассивСсылок);
		Получатели = Новый СписокЗначений;
		А1Э_Механизмы.ВыполнитьМеханизмыОбработчика("А1Емэйл_ПриОпределенииПолучателей", МассивСсылок, Получатели);
		Возврат Получатели;	
	#КонецЕсли	 
КонецФункции

Функция ИмяМодуля() Экспорт
	Возврат "А1Емэйл";	
КонецФункции 