// Возвращает получателей электронного письма, соответствующих определенному набору ссылок.
// Переопределяется с помощью механизмов.
//
// Параметры:
//  МассивСсылок - Массив - 
// 
// Возвращаемое значение:
//   - СписокЗначений
//     * Значение - адрес электронной почты.
//     * Представление - представление адреса.
//
Функция Получатели(МассивСсылок) Экспорт
	Получатели = Новый СписокЗначений;
	А1Э_Механизмы.ВыполнитьМеханизмыОбработчика("А1Емэйл_ПриОпределенииПолучателей", МассивСсылок, Получатели);
	Возврат Получатели;
КонецФункции 